# TODO
# تمرین : برنامه ای بنویسید که نام دانش آموز و نمرات سه درس او را از ورودی در یافت نماید
# و سپس معدل او را محاسبه کند
# در صورتی که معدل او از نوزده بیشتر بود
# A
# را پر ینت کند

# در صورتی که معدل او از هجده بیشتر بود
# B
# را پر ینت کند

# در صورتی که معدل او از هفده بیشتر بود
# C
# را پر ینت کند

# در صورتی که معدل او از شانزده بیشتر بود
# D
# را پر ینت کند

# در صورتی که معدل او از پانزده بیشتر بود
# E
# را پر ینت کند

# در غیراینصورت 
# F
# را پرینت کند

# TODO

# تمرین دوم:
# برنامه ای بنویسید که دمای هوای محیط را از ورودی دریافت نماید
# در صورتی که دما بیشتر از 40 بود
# Hot
#  را پرینت نماید
# در صورتی که دما از صفر کمتر بود
# Very cold 
# را پرینت نماید
# در غیر اینصورت 
# Normal
# را پرینت نماید