# for i in range(5):

#     print("hello world")

# print("outside")

# for i in range(5):
#     print(i)


# for i in range(1,5):
#     print(i)


# for i in range(10,26):
#     print(i, end="   ")

# for i in range(2,11,2):
#     print(i, end=" ")

# for i in range(1,11, 2):
#     print(i)


# TODO تمرین اول:
# با کمک حلقه فور برنامه ای بنویسید که
# پنج عدد از ورودی دریافت نماید و حاصل جمع آنها را نمایش دهد

# راهنمایی:
# ابتدا بیرون حلقه فور یک متغیر تعریف کنید و مقدار ان را مساوی صفر قرار دهید
# سپس داخل حلقه فور، یک متغیر تعریف کنید و با کمک تابع 
# input
# عدد را از ورودی بگیرید
# و جمع کنید


# تمرین دوم
# با کمک حلقه فور برنامه ای بنویسید که سه عدد از ورودی دریافت نماید 
# و فقط جمع اعداد زوج را نمایش دهد

# if number % 2 == 0: تشخیص عدد زوج

# تمرین سوم
# با کمک حلقه فور برنامه ای بنویسید که چهار عدد از ورودی دریافت نماید و
# فقط جمع اعدا فرد را نمایش دهد

# if number % 2 != 0: تشخیص عدد فرد


for i in range(10):
    print(i ,end=" ")

print()

for i in range(9, 0, -1):
    print(i, end=" ")
    
print()

for i in range(9,-1,-1):
    print(i, end=" ")